Static-Analysis-of-the-discord-APK.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org.css"/>
#+OPTIONS: num:0 toc:nil html-postamble:nil
#+PROPERTY: header-args :tangle yes :exports both :eval no-export :results output
 - [[file:index.html][home]]
* Static Analysis of the discord APK
** Overview
  When performing static analysis of an android APK file I often find myself doing the same tasks, with this repetition should come automation. I decided to download the [[https://apkpure.com/discord-chat-for-gamers/com.discord][discord apk]] and peform the initial tasks to write a script. I'll be using [[https://ibotpeaches.github.io/Apktool/][apktool]] and [[https://www.radare.org/r/][radare2]] as well as =grep= to get some initial information about the =apk=.
** Extract the apk
  First we have to extract the =apk= file with =apktool= so the =AndroidManifest.xml= is readable.
  #+begin_src shell ~/Downloads/Discord/
    java -jar /usr/local/bin/apktool.jar d ./Discord.apk -o apk-extracted
  #+end_src

  #+RESULTS:
  #+begin_example
  I: Using Apktool 2.3.4 on Discord.apk
  I: Loading resource table...
  I: Decoding AndroidManifest.xml with resources...
  I: Loading resource table from file: /home/jthorpe/.local/share/apktool/framework/1.apk
  I: Regular manifest package...
  I: Decoding file-resources...
  I: Decoding values */* XMLs...
  I: Baksmaling classes.dex...
  I: Baksmaling classes2.dex...
  I: Copying assets and libs...
  I: Copying unknown files...
  I: Copying original files...
  #+end_example
 Next we have to unzip the =apk= too 
** Android Permissions
  Now that the apk has been extracted we can look at the =AndroidManifest.xml= for any permissions required by the application.
  #+begin_src shell :dir ~/Downloads/Discord/apk-anal/smali/ :results output
    grep "permission" AndroidManifest.xml
  #+end_src

  #+RESULTS:
  #+begin_example
      <uses-permission android:name="android.permission.ACCESS_NETWORK_STATE"/>
      <uses-permission android:name="android.permission.BLUETOOTH"/>
      <uses-permission android:name="android.permission.BROADCAST_STICKY"/>
      <uses-permission android:name="android.permission.INTERNET"/>
      <uses-permission android:name="android.permission.GET_ACCOUNTS"/>
      <uses-permission android:name="android.permission.READ_EXTERNAL_STORAGE"/>
      <uses-permission android:name="android.permission.WRITE_EXTERNAL_STORAGE"/>
      <uses-permission android:name="android.permission.CAMERA"/>
      <uses-permission android:name="android.permission.FOREGROUND_SERVICE"/>
      <uses-permission android:name="android.permission.RECORD_AUDIO"/>
      <uses-permission android:name="android.permission.MODIFY_AUDIO_SETTINGS"/>
      <uses-permission android:name="android.permission.PACKAGE_USAGE_STATS"/>
      <uses-permission android:name="android.permission.VIBRATE"/>
      <uses-permission android:name="android.permission.WAKE_LOCK"/>
      <uses-permission android:name="android.permission.SYSTEM_ALERT_WINDOW"/>
      <permission android:description="@string/app_permission_connect_desc" android:label="@string/app_permission_connect_label" android:name="com.discord.permission.CONNECT" android:protectionLevel="dangerous"/>
      <uses-permission android:name="android.permission.RECEIVE_BOOT_COMPLETED"/>
      <uses-permission android:name="com.google.android.c2dm.permission.RECEIVE"/>
      <uses-permission android:name="com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE"/>
	  <service android:exported="true" android:name="com.discord.app.DiscordConnectService" android:permission="com.discord.permission.CONNECT">
	  <receiver android:enabled="true" android:exported="true" android:name="com.discord.utilities.receiver.CampaignReceiver" android:permission="android.permission.INSTALL_PACKAGES">
	  <service android:directBootAware="false" android:enabled="@bool/enable_system_job_service_default" android:exported="true" android:name="androidx.work.impl.background.systemjob.SystemJobService" android:permission="android.permission.BIND_JOB_SERVICE"/>
	  <service android:enabled="true" android:exported="false" android:name="com.google.android.gms.analytics.AnalyticsJobService" android:permission="android.permission.BIND_JOB_SERVICE"/>
	  <receiver android:exported="true" android:name="com.google.firebase.iid.FirebaseInstanceIdReceiver" android:permission="com.google.android.c2dm.permission.SEND">
	  <receiver android:enabled="true" android:exported="true" android:name="com.google.android.gms.measurement.AppMeasurementInstallReferrerReceiver" android:permission="android.permission.INSTALL_PACKAGES">
	  <service android:enabled="true" android:exported="false" android:name="com.google.android.gms.measurement.AppMeasurementJobService" android:permission="android.permission.BIND_JOB_SERVICE"/>
  #+end_example
  The permissions requested by the application seem apparent to what the application does.

  Sometimes there are further =AndroidManifest.xml= files hidden within the application, lets quickly see if thats the case.
  #+begin_src shell :dir ~/Downloads/Discord/apk-anal/
    find . -name AndroidManifest.xml -print
  #+end_src

  #+RESULTS:
  : ./zip/AndroidManifest.xml
  : ./smali/AndroidManifest.xml
  : ./smali/original/AndroidManifest.xml
** Classes dex files
