Static-Analysis-of-the-discord-APK.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-07 Sat 14:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content" class="content">
<ul class="org-ul">
<li><a href="index.html">home</a></li>
</ul>
<div id="outline-container-orga9d26ff" class="outline-2">
<h2 id="orga9d26ff">Static Analysis of the discord APK</h2>
<div class="outline-text-2" id="text-orga9d26ff">
</div>
<div id="outline-container-org0cf95a5" class="outline-3">
<h3 id="org0cf95a5">Overview</h3>
<div class="outline-text-3" id="text-org0cf95a5">
<p>
When performing static analysis of an android APK file I often find myself doing the same tasks, with this repetition should come automation. I decided to download the <a href="https://apkpure.com/discord-chat-for-gamers/com.discord">discord apk</a> and peform the initial tasks to write a script. I'll be using <a href="https://ibotpeaches.github.io/Apktool/">apktool</a> and <a href="https://www.radare.org/r/">radare2</a> as well as <code>grep</code> to get some initial information about the <code>apk</code>.
</p>
</div>
</div>
<div id="outline-container-org976869a" class="outline-3">
<h3 id="org976869a">Extract the apk</h3>
<div class="outline-text-3" id="text-org976869a">
<p>
First we have to extract the <code>apk</code> file with <code>apktool</code> so the <code>AndroidManifest.xml</code> is readable.
</p>
<div class="org-src-container">
<pre class="src src-shell">java -jar /usr/local/bin/apktool.jar d ./Discord.apk -o apk-extracted
</pre>
</div>

<pre class="example" id="org8b6196a">
I: Using Apktool 2.3.4 on Discord.apk
I: Loading resource table...
I: Decoding AndroidManifest.xml with resources...
I: Loading resource table from file: /home/jthorpe/.local/share/apktool/framework/1.apk
I: Regular manifest package...
I: Decoding file-resources...
I: Decoding values */* XMLs...
I: Baksmaling classes.dex...
I: Baksmaling classes2.dex...
I: Copying assets and libs...
I: Copying unknown files...
I: Copying original files...
</pre>
<p>
Next we have to unzip the <code>apk</code> too 
</p>
</div>
</div>
<div id="outline-container-org9722361" class="outline-3">
<h3 id="org9722361">Android Permissions</h3>
<div class="outline-text-3" id="text-org9722361">
<p>
Now that the apk has been extracted we can look at the <code>AndroidManifest.xml</code> for any permissions required by the application.
</p>
<div class="org-src-container">
<pre class="src src-shell">grep <span style="font-style: italic;">"permission"</span> AndroidManifest.xml
</pre>
</div>

<pre class="example" id="orgf4f1ce8">
&lt;uses-permission android:name="android.permission.ACCESS_NETWORK_STATE"/&gt;
&lt;uses-permission android:name="android.permission.BLUETOOTH"/&gt;
&lt;uses-permission android:name="android.permission.BROADCAST_STICKY"/&gt;
&lt;uses-permission android:name="android.permission.INTERNET"/&gt;
&lt;uses-permission android:name="android.permission.GET_ACCOUNTS"/&gt;
&lt;uses-permission android:name="android.permission.READ_EXTERNAL_STORAGE"/&gt;
&lt;uses-permission android:name="android.permission.WRITE_EXTERNAL_STORAGE"/&gt;
&lt;uses-permission android:name="android.permission.CAMERA"/&gt;
&lt;uses-permission android:name="android.permission.FOREGROUND_SERVICE"/&gt;
&lt;uses-permission android:name="android.permission.RECORD_AUDIO"/&gt;
&lt;uses-permission android:name="android.permission.MODIFY_AUDIO_SETTINGS"/&gt;
&lt;uses-permission android:name="android.permission.PACKAGE_USAGE_STATS"/&gt;
&lt;uses-permission android:name="android.permission.VIBRATE"/&gt;
&lt;uses-permission android:name="android.permission.WAKE_LOCK"/&gt;
&lt;uses-permission android:name="android.permission.SYSTEM_ALERT_WINDOW"/&gt;
&lt;permission android:description="@string/app_permission_connect_desc" android:label="@string/app_permission_connect_label" android:name="com.discord.permission.CONNECT" android:protectionLevel="dangerous"/&gt;
&lt;uses-permission android:name="android.permission.RECEIVE_BOOT_COMPLETED"/&gt;
&lt;uses-permission android:name="com.google.android.c2dm.permission.RECEIVE"/&gt;
&lt;uses-permission android:name="com.google.android.finsky.permission.BIND_GET_INSTALL_REFERRER_SERVICE"/&gt;
    &lt;service android:exported="true" android:name="com.discord.app.DiscordConnectService" android:permission="com.discord.permission.CONNECT"&gt;
    &lt;receiver android:enabled="true" android:exported="true" android:name="com.discord.utilities.receiver.CampaignReceiver" android:permission="android.permission.INSTALL_PACKAGES"&gt;
    &lt;service android:directBootAware="false" android:enabled="@bool/enable_system_job_service_default" android:exported="true" android:name="androidx.work.impl.background.systemjob.SystemJobService" android:permission="android.permission.BIND_JOB_SERVICE"/&gt;
    &lt;service android:enabled="true" android:exported="false" android:name="com.google.android.gms.analytics.AnalyticsJobService" android:permission="android.permission.BIND_JOB_SERVICE"/&gt;
    &lt;receiver android:exported="true" android:name="com.google.firebase.iid.FirebaseInstanceIdReceiver" android:permission="com.google.android.c2dm.permission.SEND"&gt;
    &lt;receiver android:enabled="true" android:exported="true" android:name="com.google.android.gms.measurement.AppMeasurementInstallReferrerReceiver" android:permission="android.permission.INSTALL_PACKAGES"&gt;
    &lt;service android:enabled="true" android:exported="false" android:name="com.google.android.gms.measurement.AppMeasurementJobService" android:permission="android.permission.BIND_JOB_SERVICE"/&gt;
</pre>
<p>
The permissions requested by the application seem apparent to what the application does.
</p>

<p>
Sometimes there are further <code>AndroidManifest.xml</code> files hidden within the application, lets quickly see if thats the case.
</p>
<div class="org-src-container">
<pre class="src src-shell">find . -name AndroidManifest.xml -print
</pre>
</div>

<pre class="example">
./zip/AndroidManifest.xml
./smali/AndroidManifest.xml
./smali/original/AndroidManifest.xml
</pre>
</div>
</div>
