Static-Analysis-of-the-discord-APK.org
*** Initial Analysis
   After extracting the =apk= there are further files than the =AndroidManifest.xml= files that are intresting to us for analysis should include =.dex= files. These files hold the code to the =apk= and are used are runtime.
   #+begin_src shell :dir ~/Downloads/Discord/apk-anal/
     find . -name *.dex -print 
   #+end_src

   #+RESULTS:
   : ./zip/classes2.dex
   : ./zip/classes.dex
  
   So two =classes.dex= files found. This is pretty normal, as the =classes.dex= file can only hold a certian amount before a further =classes.dex= file is needed for the application.

   Lets first see the info for the files.
   #+begin_src python :dir ~/Downloads/Discord/apk-anal/zip/
     import r2pipe

     r = r2pipe.open("classes.dex")
     print(r.cmd("iI"))
     r = r2pipe.open("classes2.dex")
     print(r.cmd("iI"))
   #+end_src

   #+RESULTS:
   #+begin_example
   arch     dalvik
   baddr    0x0
   binsz    8576488
   bintype  class
   bits     32
   canary   false
   retguard false
   sanitiz  false
   class    035
   crypto   false
   endian   little
   havecode true
   laddr    0x0
   lang     dalvik
   linenum  false
   lsyms    false
   machine  Dalvik VM
   nx       false
   os       linux
   pic      false
   relocs   false
   static   true
   stripped false
   subsys   android
   va       false
   sha1  12-8576468c  403ab357dcab3b55d4cf13fee859f43afc31ec1b
   adler32  12-8576488c  00000000

   arch     dalvik
   baddr    0x0
   binsz    3833788
   bintype  class
   bits     32
   canary   false
   retguard false
   sanitiz  false
   class    035
   crypto   false
   endian   little
   havecode true
   laddr    0x0
   lang     dalvik
   linenum  false
   lsyms    false
   machine  Dalvik VM
   nx       false
   os       linux
   pic      false
   relocs   false
   static   true
   stripped false
   subsys   android
   va       false
   sha1  12-3833768c  968c0c2d1b8887ccdfe4520f5a977905dd2b8241
   adler32  12-3833788c  00000000

   #+end_example
  
   Great! As expected its a Dalvik VM.
*** Checking for Root detection
   Later for dynamic analysis it would be good to know if the application will run on a rooted device, to check for this we can search the strings of the =classes.dex= file for anything that may impact it running on a rooted device.
   #+begin_src python :dir ~/Downloads/Discord/apk-anal/zip/
     import r2pipe

     dexfile = ["classes.dex","classes2.dex"]
     strings = ["sudo","bin/su","superuser"]

     for dex in dexfile:
	 r = r2pipe.open(dex)
	 for string in strings:
	     print("looking for {} in {}".format(string,dex))
	     print(r.cmd("izzq~+{}".format(string)))
   #+end_src

   #+RESULTS:
   #+begin_example
   looking for sudo in classes.dex

   looking for bin/su in classes.dex

   looking for superuser in classes.dex

   looking for sudo in classes2.dex

   looking for bin/su in classes2.dex
   0x281fcb 16 15 /system/xbin/su

   looking for superuser in classes2.dex
   0x281fb0 26 25 /system/app/Superuser.apk

   #+end_example
   So it looks like the =classes2.dex= does look for the =Superuser.apk=. Something to make note of for dynamic analysis.
