Static-Analysis-of-the-discord-APK.html
<div id="outline-container-org9846af5" class="outline-3">
<h3 id="org9846af5">Classes dex files</h3>
<div class="outline-text-3" id="text-org9846af5">
</div>
<div id="outline-container-org32f142c" class="outline-4">
<h4 id="org32f142c">Initial Analysis</h4>
<div class="outline-text-4" id="text-org32f142c">
<p>
After extracting the <code>apk</code> there are further files than the <code>AndroidManifest.xml</code> files that are intresting to us for analysis should include <code>.dex</code> files. These files hold the code to the <code>apk</code> and are used are runtime.
</p>
<div class="org-src-container">
<pre class="src src-shell">find . -name *.dex -print 
</pre>
</div>

<pre class="example">
./zip/classes2.dex
./zip/classes.dex
</pre>


<p>
So two <code>classes.dex</code> files found. This is pretty normal, as the <code>classes.dex</code> file can only hold a certian amount before a further <code>classes.dex</code> file is needed for the application.
</p>

<p>
Lets first see the info for the files.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> r2pipe

<span style="font-weight: bold; font-style: italic;">r</span> = r2pipe.<span style="font-weight: bold;">open</span>(<span style="font-style: italic;">"classes.dex"</span>)
<span style="font-weight: bold;">print</span>(r.cmd(<span style="font-style: italic;">"iI"</span>))
<span style="font-weight: bold; font-style: italic;">r</span> = r2pipe.<span style="font-weight: bold;">open</span>(<span style="font-style: italic;">"classes2.dex"</span>)
<span style="font-weight: bold;">print</span>(r.cmd(<span style="font-style: italic;">"iI"</span>))
</pre>
</div>

<pre class="example" id="orgfe2ded5">
arch     dalvik
baddr    0x0
binsz    8576488
bintype  class
bits     32
canary   false
retguard false
sanitiz  false
class    035
crypto   false
endian   little
havecode true
laddr    0x0
lang     dalvik
linenum  false
lsyms    false
machine  Dalvik VM
nx       false
os       linux
pic      false
relocs   false
static   true
stripped false
subsys   android
va       false
sha1  12-8576468c  403ab357dcab3b55d4cf13fee859f43afc31ec1b
adler32  12-8576488c  00000000

arch     dalvik
baddr    0x0
binsz    3833788
bintype  class
bits     32
canary   false
retguard false
sanitiz  false
class    035
crypto   false
endian   little
havecode true
laddr    0x0
lang     dalvik
linenum  false
lsyms    false
machine  Dalvik VM
nx       false
os       linux
pic      false
relocs   false
static   true
stripped false
subsys   android
va       false
sha1  12-3833768c  968c0c2d1b8887ccdfe4520f5a977905dd2b8241
adler32  12-3833788c  00000000

</pre>

<p>
Great! As expected its a Dalvik VM.
</p>
</div>
</div>
<div id="outline-container-org43d3682" class="outline-4">
<h4 id="org43d3682">Checking for Root detection</h4>
<div class="outline-text-4" id="text-org43d3682">
<p>
Later for dynamic analysis it would be good to know if the application will run on a rooted device, to check for this we can search the strings of the <code>classes.dex</code> file for anything that may impact it running on a rooted device.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> r2pipe

<span style="font-weight: bold; font-style: italic;">dexfile</span> = [<span style="font-style: italic;">"classes.dex"</span>,<span style="font-style: italic;">"classes2.dex"</span>]
<span style="font-weight: bold; font-style: italic;">strings</span> = [<span style="font-style: italic;">"sudo"</span>,<span style="font-style: italic;">"bin/su"</span>,<span style="font-style: italic;">"superuser"</span>]

<span style="font-weight: bold;">for</span> dex <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">dexfile</span>:
    r = r2pipe.<span style="font-weight: bold;">open</span>(dex)
    <span style="font-weight: bold;">for</span> string <span style="font-weight: bold;">in</span> strings:
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"looking for {} in {}"</span>.<span style="font-weight: bold;">format</span>(string,dex))
        <span style="font-weight: bold;">print</span>(r.cmd(<span style="font-style: italic;">"izzq~+{}"</span>.<span style="font-weight: bold;">format</span>(string)))
</pre>
</div>

<pre class="example" id="org628c3ec">
looking for sudo in classes.dex

looking for bin/su in classes.dex

looking for superuser in classes.dex

looking for sudo in classes2.dex

looking for bin/su in classes2.dex
0x281fcb 16 15 /system/xbin/su

looking for superuser in classes2.dex
0x281fb0 26 25 /system/app/Superuser.apk

</pre>
<p>
So it looks like the <code>classes2.dex</code> does look for the <code>Superuser.apk</code>. Something to make note of for dynamic analysis.
</p>
</div>
</div>
