Static-Analysis-of-the-discord-APK.org
*** Possible URL endpoints
   Most the time API or URLs are in the =classes.dex= files and it would be a good idea to know these before dynamic analysis to understand all the calls that the application should be making or that it could reference.
   #+name: URLs
   #+begin_src python :dir ~/Downloads/Discord/apk-anal/zip/ :cache yes :results silent
     # encoding=utf8
     import r2pipe

     dexfile = ["classes.dex","classes2.dex"]
     strings = ["http:","https:"]

     for dex in dexfile:
	 r = r2pipe.open(dex)
	 for string in strings:
	     print("looking for {} in {}".format(string,dex))
	     print(r.cmd("izzq~+{}".format(string))).encode('utf-8')
   #+end_src


   Alright, so lets try to extract only the urls from that output so we have a nicer list.
   #+begin_src shell :var output=URLs
     for line in $output
     do
	 if [[ $(echo $line | grep -E '(http://|https://)' | wc -l) = 0 ]]
	 then
	     :
	 else
	     echo $line | grep -E '(http://|https://)'
	 fi

     done
   #+end_src   

   #+RESULTS:
   #+begin_example
   \ahttp://
   http://127.0.0.1
   ,*http://schemas.android.com/apk/res/android
   http://www.android.com/
   https://github.com/adjust/android_sdk#can-i-trigger-an-event-at-application-launch
   2getString(R.string.guild…"https://discordapp.com")
   \bhttps://
   https://account.samsung.cn
   \ehttps://account.samsung.com
   \ehttps://api.spotify.com/v1/
   https://app.adjust.com
   'https://app.adjust.com/ndjczk?campaign=
   https://cdn.discordapp.com
   &https://cdn.discordapp.com/app-assets/
   %https://cdn.discordapp.com/app-icons/
   #https://cdn.discordapp.com/avatars/
   #https://cdn.discordapp.com/banners/
   )https://cdn.discordapp.com/channel-icons/
   !https://cdn.discordapp.com/icons/
   $https://cdn.discordapp.com/splashes/
   https://discord.gg
   https://discord.gg/
   "https://discord.gg/discord-testers
   https://discord.gift
   https://discord.gift/
   https://discordapp.com
   'https://discordapp.com/acknowledgements
   \ehttps://discordapp.com/api/
   %https://discordapp.com/api//channels/
   #https://discordapp.com/api//guilds/
   6https://discordapp.com/api//sso?service=zendesk&token=
   "https://discordapp.com/api//users/
   ?https://discordapp.com/api/v6/oauth2/samsung/authorize/callback
   https://discordapp.com/app
   &https://discordapp.com/billing/premium
   ,https://discordapp.com/developers/docs/intro
   !https://discordapp.com/guidelines
   $https://discordapp.com/login/handoff
   "https://discordapp.com/store/skus/
   4https://dl.discordapp.net/apps/android/versions.json
   https://i.scdn.co/image/
   https://ko.surveymonkey.com/r/
   https://open.spotify.com/user/
   ,*https://play.google.com/store/apps/details
   =https://play.google.com/store/apps/details?id=com.authy.authy
   9https://play.google.com/store/apps/details?id=com.discord
   Thttps://play.google.com/store/apps/details?id=com.google.android.apps.authenticator2
   dhttps://play.google.com/store/apps/details?id=com.spotify.music&utm_source=discord&utm_medium=mobile
   https://reddit.com/u/
   https://status.discordapp.com/
   $https://steamcommunity.com/profiles/
   "https://support-dev.discordapp.com
   (https://support.apple.com/en-us/HT202039
   https://support.discordapp.com
   https://twitch.tv/
   https://twitter.com/discordapp
   https://us.account.samsung.com
   https://www.discordapp.com
   https://www.example.com
   https://www.facebook.com/
   #https://www.facebook.com/discordapp
   $https://www.instagram.com/discordapp
   https://www.paypal.com
   https://www.surveymonkey.com/r/
   https://www.twitter.com/
   https://youtube.com/channel/
   http://goo.gl/8Rd3yj
   http://goo.gl/8Rd3yj
   http://goo.gl/8Rd3yj
   http://goo.gl/8Rd3yj
   http://goo.gl/8Rd3yj
   http://goo.gl/8Rd3yj
   http://goo.gl/naFqQk
   http://goo.gl/8Rd3yj
   http://goo.gl/8Rd3yj
   \ahttp://
   'http://schemas.android.com/apk/res-auto
   ,*http://schemas.android.com/apk/res/android
   http://www.google-analytics.com
   https://goo.gl/NAOOOI.
   https://goo.gl/NAOOOI
   \bhttps://
   https://app-measurement.com/a
   'https://e.crashlytics.com/spi/v2/events
   https://google.com/search?
   Ahttps://pagead2.googlesyndication.com/pagead/gen_204?id=gmob-apps
   https://plus.google.com/
   Jhttps://settings.crashlytics.com/spi/v2/platforms/android/apps/%s/settings
   https://ssl.google-analytics.com
   https://www.google.com
   ohttps://www.googleadservices.com/pagead/conversion/app/deeplink?id_type=adid&sdk_version=%s&rdid=%s&bundleid=%s
   #+end_example

   Ok its not pretty but we now have a better list of URLs that are present in the =apk=.
*** Any SQL statements
   #+begin_src python :dir ~/Downloads/Discord/apk-anal/zip/
     import r2pipe

     dexfile = ["classes.dex","classes2.dex"]
     sqlStatements = ["SELECT","INSERT","DELETE","UPDATE","CREATE"]

     for dex in dexfile:
	 r = r2pipe.open(dex)
	 for statement in sqlStatements:
	     print("looking for {} in {}".format(statement,dex))
	     print(r.cmd("izzq~{}\n".format(statement))).encode('utf-8')
   #+end_src

   #+RESULTS:
   #+begin_example
     looking for SELECT in classes.dex
     0x569b32 157 156  AND (SELECT COUNT(*)=0 FROM dependency WHERE     prerequisite_id=id AND     work_spec_id NOT IN         (SELECT id FROM workspec WHERE state IN (2, 3, 5)))
     0x582c90 42 41 (ACTION_ARGUMENT_EXTEND_SELECTION_BOOLEAN
     0x582d80 35 34 !ACTION_ARGUMENT_SELECTION_END_INT
     0x582da3 37 36 #ACTION_ARGUMENT_SELECTION_START_INT
     0x582f1f 23 22 ACTION_CLEAR_SELECTION
     0x583494 15 14 \rACTION_SELECT
     0x5834a4 16 15 ACTION_SELECTOR
     0x5834ca 21 20 ACTION_SET_SELECTION
     0x5841c0 23 22 ARG_SELECTED_COLOR_KEY
     0x599f53 134 133 DELETE FROM room_table_modification_log WHERE version NOT IN( SELECT MAX(version) FROM room_table_modification_log GROUP BY table_id)
     ..snip..
   #+end_example
